{"modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 400, 400, 1]}}, {"class_name": "Conv2D", "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [2, 2], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [7, 7], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]], "config": {"trainable": true, "name": "activation", "dtype": "float32", "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d", "inbound_nodes": [[["activation", 0, 0, {}]]], "config": {"trainable": true, "name": "max_pooling2d", "dtype": "float32", "strides": [2, 2], "padding": "same", "data_format": "channels_last", "pool_size": [3, 3]}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_1", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_1", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_2", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_2", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "valid", "data_format": "channels_last", "activation": "linear", "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "Add", "name": "add", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["conv2d_3", 0, 0, {}]]], "config": {"trainable": true, "name": "add", "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["add", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_3", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_3", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_4", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_4", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_5", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_5", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "Add", "name": "add_1", "inbound_nodes": [[["add", 0, 0, {}], ["conv2d_7", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1", "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_6", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_6", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_7", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_7", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_8", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_8", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "Add", "name": "add_2", "inbound_nodes": [[["add_1", 0, 0, {}], ["conv2d_10", 0, 0, {}]]], "config": {"trainable": true, "name": "add_2", "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_9", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_9", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [2, 2], "filters": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_10", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_10", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_11", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_11", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [2, 2], "filters": 512, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "valid", "data_format": "channels_last", "activation": "linear", "name": "conv2d_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 512, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "Add", "name": "add_3", "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["conv2d_13", 0, 0, {}]]], "config": {"trainable": true, "name": "add_3", "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_12", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_12", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_13", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_13", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_16", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_14", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_14", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 512, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_17", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "Add", "name": "add_4", "inbound_nodes": [[["add_3", 0, 0, {}], ["conv2d_17", 0, 0, {}]]], "config": {"trainable": true, "name": "add_4", "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_15", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_15", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_18", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_16", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_16", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_19", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_17", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_17", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 512, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_20", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "Add", "name": "add_5", "inbound_nodes": [[["add_4", 0, 0, {}], ["conv2d_20", 0, 0, {}]]], "config": {"trainable": true, "name": "add_5", "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_18", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_18", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_21", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_19", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_19", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_22", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_20", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_20", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 512, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_23", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "Add", "name": "add_6", "inbound_nodes": [[["add_5", 0, 0, {}], ["conv2d_23", 0, 0, {}]]], "config": {"trainable": true, "name": "add_6", "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_21", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_21", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [2, 2], "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_24", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_22", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_22", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_25", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_25", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_23", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_23", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_27", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [2, 2], "filters": 1024, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "valid", "data_format": "channels_last", "activation": "linear", "name": "conv2d_27", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_26", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 1024, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_26", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "Add", "name": "add_7", "inbound_nodes": [[["conv2d_27", 0, 0, {}], ["conv2d_26", 0, 0, {}]]], "config": {"trainable": true, "name": "add_7", "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_24", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_24", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_28", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_28", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_25", "beta_regularizer": null, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_25", "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_29", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear", "name": "conv2d_29", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal", "mode": "fan_in"}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "use_bias": true, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "axis": [3], "gamma_constraint": null, "beta_initializer": 