{"weightsManifest": [{"weights": [{"dtype": "float32", "name": "batch_normalization/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization/beta", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_1/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_1/beta", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_1/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_1/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_10/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_10/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_10/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_10/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_11/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_11/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_11/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_11/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_12/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_12/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_12/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_12/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_13/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_13/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_13/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_13/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_14/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_14/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_14/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_14/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_15/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_15/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_15/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_15/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_16/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_16/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_16/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_16/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_17/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_17/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_17/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_17/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_18/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_18/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_18/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_18/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_19/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_19/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_19/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_19/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_2/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_2/beta", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_2/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_2/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_20/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_20/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_20/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_20/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_21/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_21/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_21/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_21/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_22/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_22/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_22/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_22/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_23/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_23/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_23/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_23/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_24/gamma", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_24/beta", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_24/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_24/moving_variance", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_25/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_25/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_25/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_25/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_26/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_26/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_26/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_26/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_27/gamma", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_27/beta", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_27/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_27/moving_variance", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_28/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_28/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_28/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_28/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_29/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_29/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_29/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_29/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_3/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_3/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_3/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_3/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_30/gamma", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_30/beta", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_30/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_30/moving_variance", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_31/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_31/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_31/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_31/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_32/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_32/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_32/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_32/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_33/gamma", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_33/beta", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_33/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_33/moving_variance", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_34/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_34/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_34/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_34/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_35/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_35/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_35/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_35/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_36/gamma", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_36/beta", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_36/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_36/moving_variance", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_37/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_37/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_37/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_37/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_38/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_38/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_38/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_38/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_39/gamma", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_39/beta", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_39/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_39/moving_variance", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_4/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_4/beta", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_4/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_4/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_40/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_40/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_40/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_40/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_41/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_41/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_41/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_41/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_42/gamma", "shape": [2048]}, {"dtype": "float32", "name": "batch_normalization_42/beta", "shape": [2048]}, {"dtype": "float32", "name": "batch_normalization_42/moving_mean", "shape": [2048]}, {"dtype": "float32", "name": "batch_normalization_42/moving_variance", "shape": [2048]}, {"dtype": "float32", "name": "batch_normalization_43/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_43/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_43/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_43/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_44/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_44/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_44/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_44/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_45/gamma", "shape": [2048]}, {"dtype": "float32", "name": "batch_normalization_45/beta", "shape": [2048]}, {"dtype": "float32", "name": "batch_normalization_45/moving_mean", "shape": [2048]}, {"dtype": "float32", "name": "batch_normalization_45/moving_variance", "shape": [2048]}, {"dtype": "float32", "name": "batch_normalization_46/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_46/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_46/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_46/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_47/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_47/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_47/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_47/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_48/gamma", "shape": [2048]}, {"dtype": "float32", "name": "batch_normalization_48/beta", "shape": [2048]}, {"dtype": "float32", "name": "batch_normalization_48/moving_mean", "shape": [2048]}, {"dtype": "float32", "name": "batch_normalization_48/moving_variance", "shape": [2048]}, {"dtype": "float32", "name": "batch_normalization_5/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_5/beta", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_5/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_5/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_6/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_6/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_6/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_6/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_7/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_7/beta", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_7/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_7/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_8/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_8/beta", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_8/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_8/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_9/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_9/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_9/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_9/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "conv2d/kernel", "shape": [7, 7, 1, 64]}, {"dtype": "float32", "name": "conv2d/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_1/kernel", "shape": [1, 1, 64, 64]}, {"dtype": "float32", "name": "conv2d_1/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_10/kernel", "shape": [1, 1, 64, 256]}, {"dtype": "float32", "name": "conv2d_10/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_11/kernel", "shape": [1, 1, 256, 128]}, {"dtype": "float32", "name": "conv2d_11/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_12/kernel", "shape": [3, 3, 128, 128]}, {"dtype": "float32", "name": "conv2d_12/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_13/kernel", "shape": [1, 1, 128, 512]}, {"dtype": "float32", "name": "conv2d_13/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_14/kernel", "shape": [1, 1, 256, 512]}, {"dtype": "float32", "name": "conv2d_14/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_15/kernel", "shape": [1, 1, 512, 128]}, {"dtype": "float32", "name": "conv2d_15/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_16/kernel", "shape": [3, 3, 128, 128]}, {"dtype": "float32", "name": "conv2d_16/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_17/kernel", "shape": [1, 1, 128, 512]}, {"dtype": "float32", "name": "conv2d_17/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_18/kernel", "shape": [1, 1, 512, 128]}, {"dtype": "float32", "name": "conv2d_18/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_19/kernel", "shape": [3, 3, 128, 128]}, {"dtype": "float32", "name": "conv2d_19/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_2/kernel", "shape": [3, 3, 64, 64]}, {"dtype": "float32", "name": "conv2d_2/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_20/kernel", "shape": [1, 1, 128, 512]}, {"dtype": "float32", "name": "conv2d_20/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_21/kernel", "shape": [1, 1, 512, 128]}, {"dtype": "float32", "name": "conv2d_21/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_22/kernel", "shape": [3, 3, 128, 128]}, {"dtype": "float32", "name": "conv2d_22/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_23/kernel", "shape": [1, 1, 128, 512]}, {"dtype": "float32", "name": "conv2d_23/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_24/kernel", "shape": [1, 1, 512, 256]}, {"dtype": "float32", "name": "conv2d_24/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_25/kernel", "shape": [3, 3, 256, 256]}, {"dtype": "float32", "name": "conv2d_25/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_26/kernel", "shape": [1, 1, 256, 1024]}, {"dtype": "float32", "name": "conv2d_26/bias", "shape": [1024]}, {"dtype": "float32", "name": "conv2d_27/kernel", "shape": [1, 1, 512, 1024]}, {"dtype": "float32", "name": "conv2d_27/bias", "shape": [1024]}, {"dtype": "float32", "name": "conv2d_28/kernel", "shape": [1, 1, 1024, 256]}, {"dtype": "float32", "name": "conv2d_28/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_29/kernel", "shape": [3, 3, 256, 256]}, {"dtype": "float32", "name": "conv2d_29/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_3/kernel", "shape": [1, 1, 64, 256]}, {"dtype": "float32", "name": "conv2d_3/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_30/kernel", "shape": [1, 1, 256, 1024]}, {"dtype": "float32", "name": "conv2d_30/bias", "shape": [1024]}, {"dtype": "float32", "name": "conv2d_31/kernel", "shape": [1, 1, 1024, 256]}, {"dtype": "float32", "name": "conv2d_31/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_32/kernel", "shape": [3, 3, 256, 256]}, {"dtype": "float32", "name": "conv2d_32/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_33/kernel", "shape": [1, 1, 256, 1024]}, {"dtype": "float32", "name": "conv2d_33/bias", "shape": [1024]}, {"dtype": "float32", "name": "conv2d_34/kernel", "shape": [1, 1, 1024, 256]}, {"dtype": "float32", "name": "conv2d_34/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_35/kernel", "shape": [3, 3, 256, 256]}, {"dtype": "float32", "name": "conv2d_35/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_36/kernel", "shape": [1, 1, 256, 1024]}, {"dtype": "float32", "name": "conv2d_36/bias", "shape": [1024]}, {"dtype": "float32", "name": "conv2d_37/kernel", "shape": [1, 1, 1024, 256]}, {"dtype": "float32", "name": "conv2d_37/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_38/kernel", "shape": [3, 3, 256, 256]}, {"dtype": "float32", "name": "conv2d_38/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_39/kernel", "shape": [1, 1, 256, 1024]}, {"dtype": "float32", "name": "conv2d_39/bias", "shape": [1024]}, {"dtype": "float32", "name": "conv2d_4/kernel", "shape": [1, 1, 64, 256]}, {"dtype": "float32", "name": "conv2d_4/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_40/kernel", "shape": [1, 1, 1024, 256]}, {"dtype": "float32", "name": "conv2d_40/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_41/kernel", "shape": [3, 3, 256, 256]}, {"dtype": "float32", "name": "conv2d_41/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_42/kernel", "shape": [1, 1, 256, 1024]}, {"dtype": "float32", "name": "conv2d_42/bias", "shape": [1024]}, {"dtype": "float32", "name": "conv2d_43/kernel", "shape": [1, 1, 1024, 512]}, {"dtype": "float32", "name": "conv2d_43/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_44/kernel", "shape": [3, 3, 512, 512]}, {"dtype": "float32", "name": "conv2d_44/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_45/kernel", "shape": [1, 1, 512, 2048]}, {"dtype": "float32", "name": "conv2d_45/bias", "shape": [2048]}, {"dtype": "float32", "name": "conv2d_46/kernel", "shape": [1, 1, 1024, 2048]}, {"dtype": "float32", "name": "conv2d_46/bias", "shape": [2048]}, {"dtype": "float32", "name": "conv2d_47/kernel", "shape": [1, 1, 2048, 512]}, {"dtype": "float32", "name": "conv2d_47/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_48/kernel", "shape": [3, 3, 512, 512]}, {"dtype": "float32", "name": "conv2d_48/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_49/kernel", "shape": [1, 1, 512, 2048]}, {"dtype": "float32", "name": "conv2d_49/bias", "shape": [2048]}, {"dtype": "float32", "name": "conv2d_5/kernel", "shape": [1, 1, 256, 64]}, {"dtype": "float32", "name": "conv2d_5/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_50/kernel", "shape": [1, 1, 2048, 512]}, {"dtype": "float32", "name": "conv2d_50/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_51/kernel", "shape": [3, 3, 512, 512]}, {"dtype": "float32", "name": "conv2d_51/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_52/kernel", "shape": [1, 1, 512, 2048]}, {"dtype": "float32", "name": "conv2d_52/bias", "shape": [2048]}, {"dtype": "float32", "name": "conv2d_6/kernel", "shape": [3, 3, 64, 64]}, {"dtype": "float32", "name": "conv2d_6/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_7/kernel", "shape": [1, 1, 64, 256]}, {"dtype": "float32", "name": "conv2d_7/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_8/kernel", "shape": [1, 1, 256, 64]}, {"dtype": "float32", "name": "conv2d_8/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_9/kernel", "shape": [3, 3, 64, 64]}, {"dtype": "float32", "name": "conv2d_9/bias", "shape": [64]}, {"dtype": "float32", "name": "dense/kernel", "shape": [2048, 7]}, {"dtype": "float32", "name": "dense/bias", "shape": [7]}], "paths": ["group1-shard1of23", "group1-shard2of23", "group1-shard3of23", "group1-shard4of23", "group1-shard5of23", "group1-shard6of23", "group1-shard7of23", "group1-shard8of23", "group1-shard9of23", "group1-shard10of23", "group1-shard11of23", "group1-shard12of23", "group1-shard13of23", "group1-shard14of23", "group1-shard15of23", "group1-shard16of23", "group1-shard17of23", "group1-shard18of23", "group1-shard19of23", "group1-shard20of23", "group1-shard21of23", "group1-shard22of23", "group1-shard23of23"]}], "modelTopology": {"backend": "tensorflow", "training_config": {"metrics": ["accuracy"], "optimizer_config": {"class_name": "Adam", "config": {"lr": 3.1622778351447778e-06, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss_weights": null, "loss": "categorical_crossentropy", "sample_weight_mode": null}, "model_config": {"class_name": "Model", "config": {"output_layers": [["dense", 0, 0]], "name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 400, 400, 1], "sparse": false, "name": "input_1", "dtype": "float32"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [2, 2], "kernel_size": [7, 7], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "momentum": 0.99, "dtype": "float32", "center": true, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"dtype": "float32", "name": "activation", "trainable": true, "activation": "relu"}, "name": "activation", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [3, 3], "dtype": "float32", "name": "max_pooling2d", "padding": "same", "strides": [2, 2]}, "name": "max_pooling2d", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_1", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_1", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "momentum": 0.99, "dtype": "float32", "center": true, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"dtype": "float32", "name": "activation_1", "trainable": true, "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_2", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "momentum": 0.99, "dtype": "float32", "center": true, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"dtype": "float32", "name": "activation_2", "trainable": true, "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_4", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "valid", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"dtype": "float32", "name": "add", "trainable": true}, "name": "add", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["conv2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_3", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "momentum": 0.99, "dtype": "float32", "center": true, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization_3", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"dtype": "float32", "name": "activation_3", "trainable": true, "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_5", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_5", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_4", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "momentum": 0.99, "dtype": "float32", "center": true, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"dtype": "float32", "name": "activation_4", "trainable": true, "activation": "relu"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_6", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_6", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_5", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "momentum": 0.99, "dtype": "float32", "center": true, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"dtype": "float32", "name": "activation_5", "trainable": true, "activation": "relu"}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_7", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_7", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Add", "config": {"dtype": "float32", "name": "add_1", "trainable": true}, "name": "add_1", "inbound_nodes": [[["add", 0, 0, {}], ["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_6", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "momentum": 0.99, "dtype": "float32", "center": true, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization_6", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"dtype": "float32", "name": "activation_6", "trainable": true, "activation": "relu"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_8", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_8", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_7", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "momentum": 0.99, "dtype": "float32", "center": true, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"dtype": "float32", "name": "activation_7", "trainable": true, "activation": "relu"}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_9", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_9", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_8", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "momentum": 0.99, "dtype": "float32", "center": true, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"dtype": "float32", "name": "activation_8", "trainable": true, "activation": "relu"}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_10", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_10", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Add", "config": {"dtype": "float32", "name": "add_2", "trainable": true}, "name": "add_2", "inbound_nodes": [[["add_1", 0, 0, {}], ["conv2d_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_9", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "momentum": 0.99, "dtype": "float32", "center": true, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization_9", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"dtype": "float32", "name": "activation_9", "trainable": true, "activation": "relu"}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_11", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [2, 2], "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_11", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_10", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "momentum": 0.99, "dtype": "float32", "center": true, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"dtype": "float32", "name": "activation_10", "trainable": true, "activation": "relu"}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_12", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_12", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_11", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "momentum": 0.99, "dtype": "float32", "center": true, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"dtype": "float32", "name": "activation_11", "trainable": true, "activation": "relu"}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 512, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_14", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [2, 2], "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "valid", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_14", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 512, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_13", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null}, "name": "conv2d_13", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Add", "config": {"dtype": "float32", "name": "add_3", "trainable": true}, "name": "add_3", "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "name": "batch_normalization_12", "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "momentum": 0.99, "dtype": "float32", "center": true, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}, "name": "batch_normalization_12", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"dtype": "float32", "name": "activation_12", "trainable": true, "activation": "relu"}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_15", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "strides": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", 